// Задайте массив из 12 элементов, заполненный случайными числами
// из промежутка [-9, 9]. Найдите сумму отрицательных и положительных элементов 
// массива.

// int[] GetArray(int size, int min, int max)
// {
//     int[] res = new int[size];
//     for (int i = 0; i < size; i++)
//     {
//         res[i] = new Random().Next(min, max + 1);
//         System.Console.Write($"{res[i]} ");
//     }
//     System.Console.WriteLine();
//     return res;
// }

// System.Console.Write("Введите число элементов массива: ");
// int n = Convert.ToInt32(Console.ReadLine());

// System.Console.Write("Введите минимальный элемент массива: ");
// int minArr = Convert.ToInt32(Console.ReadLine());

// System.Console.Write("Введите максимальный элемент массива: ");
// int maxArr = Convert.ToInt32(Console.ReadLine());

// int [] arr = GetArray(n, minArr, maxArr);


// int sumPos = 0;
// int sumNeg = 0;

// for (int i = 0; i < arr.Length; i++)
// {
//     if (arr[i] > 0) sumPos += arr[i];
//     else sumNeg += arr[i];
// }
// System.Console.WriteLine($"Сумма положительных элементов массива равна: {sumPos}");
// System.Console.WriteLine($"Сумма отрицательных элементов массива равна: {sumNeg}");
// ________________________________________________________________________________________


